---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Edge..::..IsFlippedOnFace Method
Edge Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | IsFlippedOnFace(Int32) | Determines if this edge's topological direction on the Face is opposite to its parametric direction. |
|  | IsFlippedOnFace(Face) | Determines if this edge's topological direction on the Face is opposite to its parametric direction. |

# See Also

Edge Class

Edge Members

Autodesk.Revit.DB Namespace